fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_emac.h
//*****************************************************************************
//
// hw_emac.h - Macros used when accessing the EMAC hardware.
//
// Copyright (c) 2012-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __HW_EMAC_H__
#define __HW_EMAC_H__

//*****************************************************************************
//
// The following are defines for the EMAC register offsets.
//
//*****************************************************************************
#define EMAC_O_CFG       0x00000000 // Ethernet MAC Configuration
#define EMAC_O_FRAMEFLTR 0x00000004 // Ethernet MAC Frame Filter
#define EMAC_O_HASHTBLH  0x00000008 // Ethernet MAC Hash Table High
#define EMAC_O_HASHTBLL  0x0000000C // Ethernet MAC Hash Table Low
#define EMAC_O_MIIADDR   0x00000010 // Ethernet MAC MII Address
#define EMAC_O_MIIDATA   0x00000014 // Ethernet MAC MII Data Register
#define EMAC_O_FLOWCTL   0x00000018 // Ethernet MAC Flow Control
#define EMAC_O_VLANTG    0x0000001C // Ethernet MAC VLAN Tag
#define EMAC_O_STATUS    0x00000024 // Ethernet MAC Status
#define EMAC_O_RWUFF \
    0x00000028                      // Ethernet MAC Remote Wake-Up
                                    // Frame Filter
#define EMAC_O_PMTCTLSTAT \
    0x0000002C                      // Ethernet MAC PMT Control and
                                    // Status Register
#define EMAC_O_LPICTLSTAT \
    0x00000030                      // Ethernet MAC Low Power Idle
                                    // Control and Status Register
#define EMAC_O_LPITIMERCTL \
    0x00000034                      // Ethernet MAC Low Power Idle
                                    // Timer Control Register
#define EMAC_O_RIS \
    0x00000038                      // Ethernet MAC Raw Interrupt
                                    // Status
#define EMAC_O_IM     0x0000003C    // Ethernet MAC Interrupt Mask
#define EMAC_O_ADDR0H 0x00000040    // Ethernet MAC Address 0 High
#define EMAC_O_ADDR0L \
    0x00000044                      // Ethernet MAC Address 0 Low
                                    // Register
#define EMAC_O_ADDR1H  0x00000048   // Ethernet MAC Address 1 High
#define EMAC_O_ADDR1L  0x0000004C   // Ethernet MAC Address 1 Low
#define EMAC_O_ADDR2H  0x00000050   // Ethernet MAC Address 2 High
#define EMAC_O_ADDR2L  0x00000054   // Ethernet MAC Address 2 Low
#define EMAC_O_ADDR3H  0x00000058   // Ethernet MAC Address 3 High
#define EMAC_O_ADDR3L  0x0000005C   // Ethernet MAC Address 3 Low
#define EMAC_O_WDOGTO  0x000000DC   // Ethernet MAC Watchdog Timeout
#define EMAC_O_MMCCTRL 0x00000100   // Ethernet MAC MMC Control
#define EMAC_O_MMCRXRIS \
    0x00000104                      // Ethernet MAC MMC Receive Raw
                                    // Interrupt Status
#define EMAC_O_MMCTXRIS \
    0x00000108                      // Ethernet MAC MMC Transmit Raw
                                    // Interrupt Status
#define EMAC_O_MMCRXIM \
    0x0000010C                      // Ethernet MAC MMC Receive
                                    // Interrupt Mask
#define EMAC_O_MMCTXIM \
    0x00000110                      // Ethernet MAC MMC Transmit
                                    // Interrupt Mask
#define EMAC_O_TXCNTGB \
    0x00000118                      // Ethernet MAC Transmit Frame
                                    // Count for Good and Bad Frames
#define EMAC_O_TXCNTSCOL \
    0x0000014C                      // Ethernet MAC Transmit Frame
                                    // Count for Frames Transmitted
                                    // after Single Collision
#define EMAC_O_TXCNTMCOL \
    0x00000150                      // Ethernet MAC Transmit Frame
                                    // Count for Frames Transmitted
                                    // after Multiple Collisions
#define EMAC_O_TXOCTCNTG \
    0x00000164                      // Ethernet MAC Transmit Octet
                                    // Count Good
#define EMAC_O_RXCNTGB \
    0x00000180                      // Ethernet MAC Receive Frame Count
                                    // for Good and Bad Frames
#define EMAC_O_RXCNTCRCERR \
    0x00000194                      // Ethernet MAC Receive Frame Count
                                    // for CRC Error Frames
#define EMAC_O_RXCNTALGNERR \
    0x00000198                      // Ethernet MAC Receive Frame Count
                                    // for Alignment Error Frames
#define EMAC_O_RXCNTGUNI \
    0x000001C4                      // Ethernet MAC Receive Frame Count
                                    // for Good Unicast Frames
#define EMAC_O_VLNINCREP \
    0x00000584                      // Ethernet MAC VLAN Tag Inclusion
                                    // or Replacement
#define EMAC_O_VLANHASH  0x00000588 // Ethernet MAC VLAN Hash Table
#define EMAC_O_TIMSTCTRL 0x00000700 // Ethernet MAC Timestamp Control
#define EMAC_O_SUBSECINC \
    0x00000704                      // Ethernet MAC Sub-Second
                                    // Increment
#define EMAC_O_TIMSEC \
    0x00000708                      // Ethernet MAC System Time -
                                    // Seconds
#define EMAC_O_TIMNANO \
    0x0000070C                      // Ethernet MAC System Time -
                                    // Nanoseconds
#define EMAC_O_TIMSECU \
    0x00000710                      // Ethernet MAC System Time -
                                    // Seconds Update
#define EMAC_O_TIMNANOU \
    0x00000714                      // Ethernet MAC System Time -
                                    // Nanoseconds Update
#define EMAC_O_TIMADD  0x00000718   // Ethernet MAC Timestamp Addend
#define EMAC_O_TARGSEC 0x0000071C   // Ethernet MAC Target Time Seconds
#define EMAC_O_TARGNANO \
    0x00000720                      // Ethernet MAC Target Time
                                    // Nanoseconds
#define EMAC_O_HWORDSEC \
    0x00000724                      // Ethernet MAC System Time-Higher
                                    // Word Seconds
#define EMAC_O_TIMSTAT   0x00000728 // Ethernet MAC Timestamp Status
#define EMAC_O_PPSCTRL   0x0000072C // Ethernet MAC PPS Control
#define EMAC_O_PPS0INTVL 0x00000760 // Ethernet MAC PPS0 Interval
#define EMAC_O_PPS0WIDTH 0x00000764 // Ethernet MAC PPS0 Width
#define EMAC_O_DMABUSMOD 0x00000C00 // Ethernet MAC DMA Bus Mode
#define EMAC_O_TXPOLLD \
    0x00000C04                      // Ethernet MAC Transmit Poll
                                    // Demand
#define EMAC_O_RXPOLLD 0x00000C08   // Ethernet MAC Receive Poll Demand
#define EMAC_O_RXDLADDR \
    0x00000C0C                      // Ethernet MAC Receive Descriptor
                                    // List Address
#define EMAC_O_TXDLADDR \
    0x00000C10                      // Ethernet MAC Transmit Descriptor
                                    // List Address
#define EMAC_O_DMARIS \
    0x00000C14                      // Ethernet MAC DMA Interrupt
                                    // Status
#define EMAC_O_DMAOPMODE 0x00000C18 // Ethernet MAC DMA Operation Mode
#define EMAC_O_DMAIM \
    0x00000C1C                      // Ethernet MAC DMA Interrupt Mask
                                    // Register
#define EMAC_O_MFBOC \
    0x00000C20                      // Ethernet MAC Missed Frame and
                                    // Buffer Overflow Counter
#define EMAC_O_RXINTWDT \
    0x00000C24                      // Ethernet MAC Receive Interrupt
                                    // Watchdog Timer
#define EMAC_O_HOSTXDESC \
    0x00000C48                      // Ethernet MAC Current Host
                                    // Transmit Descriptor
#define EMAC_O_HOSRXDESC \
    0x00000C4C                      // Ethernet MAC Current Host
                                    // Receive Descriptor
#define EMAC_O_HOSTXBA \
    0x00000C50                      // Ethernet MAC Current Host
                                    // Transmit Buffer Address
#define EMAC_O_HOSRXBA \
    0x00000C54                      // Ethernet MAC Current Host
                                    // Receive Buffer Address
#define EMAC_O_PP \
    0x00000FC0                      // Ethernet MAC Peripheral Property
                                    // Register
#define EMAC_O_PC \
    0x00000FC4                      // Ethernet MAC Peripheral
                                    // Configuration Register
#define EMAC_O_CC \
    0x00000FC8                      // Ethernet MAC Clock Configuration
                                    // Register
#define EMAC_O_EPHYRIS \
    0x00000FD0                      // Ethernet PHY Raw Interrupt
                                    // Status
#define EMAC_O_EPHYIM 0x00000FD4    // Ethernet PHY Interrupt Mask
#define EMAC_O_EPHYMISC \
    0x00000FD8                      // Ethernet PHY Masked Interrupt
                                    // Status and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_CFG register.
//
//*****************************************************************************
#define EMAC_CFG_TWOKPEN 0x08000000  // IEEE 802
#define EMAC_CFG_CST     0x02000000  // CRC Stripping for Type Frames
#define EMAC_CFG_WDDIS   0x00800000  // Watchdog Disable
#define EMAC_CFG_JD      0x00400000  // Jabber Disable
#define EMAC_CFG_JFEN    0x00100000  // Jumbo Frame Enable
#define EMAC_CFG_IFG_M   0x000E0000  // Inter-Frame Gap (IFG)
#define EMAC_CFG_IFG_96  0x00000000  // 96 bit times
#define EMAC_CFG_IFG_88  0x00020000  // 88 bit times
#define EMAC_CFG_IFG_80  0x00040000  // 80 bit times
#define EMAC_CFG_IFG_72  0x00060000  // 72 bit times
#define EMAC_CFG_IFG_64  0x00080000  // 64 bit times
#define EMAC_CFG_IFG_56  0x000A0000  // 56 bit times
#define EMAC_CFG_IFG_48  0x000C0000  // 48 bit times
#define EMAC_CFG_IFG_40  0x000E0000  // 40 bit times
#define EMAC_CFG_DISCRS \
    0x00010000                       // Disable Carrier Sense During
                                     // Transmission
#define EMAC_CFG_PS      0x00008000  // Port Select
#define EMAC_CFG_FES     0x00004000  // Speed
#define EMAC_CFG_DRO     0x00002000  // Disable Receive Own
#define EMAC_CFG_LOOPBM  0x00001000  // Loopback Mode
#define EMAC_CFG_DUPM    0x00000800  // Duplex Mode
#define EMAC_CFG_IPC     0x00000400  // Checksum Offload
#define EMAC_CFG_DR      0x00000200  // Disable Retry
#define EMAC_CFG_ACS     0x00000080  // Automatic Pad or CRC Stripping
#define EMAC_CFG_BL_M    0x00000060  // Back-Off Limit
#define EMAC_CFG_BL_1024 0x00000000  // k = min (n,10)
#define EMAC_CFG_BL_256  0x00000020  // k = min (n,8)
#define EMAC_CFG_BL_8    0x00000040  // k = min (n,4)
#define EMAC_CFG_BL_2    0x00000060  // k = min (n,1)
#define EMAC_CFG_DC      0x00000010  // Deferral Check
#define EMAC_CFG_TE      0x00000008  // Transmitter Enable
#define EMAC_CFG_RE      0x00000004  // Receiver Enable
#define EMAC_CFG_PRELEN_M \
    0x00000003                       // Preamble Length for Transmit
                                     // Frames
#define EMAC_CFG_PRELEN_7 0x00000000 // 7 bytes of preamble
#define EMAC_CFG_PRELEN_5 0x00000001 // 5 bytes of preamble
#define EMAC_CFG_PRELEN_3 0x00000002 // 3 bytes of preamble

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_FRAMEFLTR
// register.
//
//*****************************************************************************
#define EMAC_FRAMEFLTR_RA   0x80000000  // Receive All
#define EMAC_FRAMEFLTR_VTFE 0x00010000  // VLAN Tag Filter Enable
#define EMAC_FRAMEFLTR_HPF  0x00000400  // Hash or Perfect Filter
#define EMAC_FRAMEFLTR_SAF  0x00000200  // Source Address Filter Enable
#define EMAC_FRAMEFLTR_SAIF \
    0x00000100                          // Source Address (SA) Inverse
                                        // Filtering
#define EMAC_FRAMEFLTR_PCF_M 0x000000C0 // Pass Control Frames
#define EMAC_FRAMEFLTR_PCF_ALL \
    0x00000000                          // The MAC filters all control
                                        // frames from reaching application
#define EMAC_FRAMEFLTR_PCF_PAUSE \
    0x00000040                          // MAC forwards all control frames
                                        // except PAUSE control frames to
                                        // application even if they fail
                                        // the address filter
#define EMAC_FRAMEFLTR_PCF_NONE \
    0x00000080                          // MAC forwards all control frames
                                        // to application even if they fail
                                        // the address Filter
#define EMAC_FRAMEFLTR_PCF_ADDR \
    0x000000C0                          // MAC forwards control frames that
                                        // pass the address Filter
#define EMAC_FRAMEFLTR_DBF 0x00000020   // Disable Broadcast Frames
#define EMAC_FRAMEFLTR_PM  0x00000010   // Pass All Multicast
#define EMAC_FRAMEFLTR_DAIF \
    0x00000008                          // Destination Address (DA) Inverse
                                        // Filtering
#define EMAC_FRAMEFLTR_HMC 0x00000004   // Hash Multicast
#define EMAC_FRAMEFLTR_HUC 0x00000002   // Hash Unicast
#define EMAC_FRAMEFLTR_PR  0x00000001   // Promiscuous Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HASHTBLH
// register.
//
//*****************************************************************************
#define EMAC_HASHTBLH_HTH_M 0xFFFFFFFF // Hash Table High
#define EMAC_HASHTBLH_HTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HASHTBLL
// register.
//
//*****************************************************************************
#define EMAC_HASHTBLL_HTL_M 0xFFFFFFFF // Hash Table Low
#define EMAC_HASHTBLL_HTL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MIIADDR register.
//
//*****************************************************************************
#define EMAC_MIIADDR_PLA_M 0x0000F800 // Physical Layer Address
#define EMAC_MIIADDR_MII_M 0x000007C0 // MII Register
#define EMAC_MIIADDR_CR_M \
    0x0000003C                        // Clock Reference Frequency
                                      // Selection
#define EMAC_MIIADDR_CR_60_100 \
    0x00000000                        // The frequency of the System
                                      // Clock is 60 to 100 MHz providing
                                      // a MDIO clock of SYSCLK/42
#define EMAC_MIIADDR_CR_100_150 \
    0x00000004                        // The frequency of the System
                                      // Clock is 100 to 150 MHz
                                      // providing a MDIO clock of
                                      // SYSCLK/62
#define EMAC_MIIADDR_CR_20_35 \
    0x00000008                        // The frequency of the System
                                      // Clock is 20-35 MHz providing a
                                      // MDIO clock of System Clock/16
#define EMAC_MIIADDR_CR_35_60 \
    0x0000000C                        // The frequency of the System
                                      // Clock is 35 to 60 MHz providing
                                      // a MDIO clock of System Clock/26
#define EMAC_MIIADDR_MIIW  0x00000002 // MII Write
#define EMAC_MIIADDR_MIIB  0x00000001 // MII Busy
#define EMAC_MIIADDR_PLA_S 11
#define EMAC_MIIADDR_MII_S 6

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MIIDATA register.
//
//*****************************************************************************
#define EMAC_MIIDATA_DATA_M 0x0000FFFF // MII Data
#define EMAC_MIIDATA_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_FLOWCTL register.
//
//*****************************************************************************
#define EMAC_FLOWCTL_PT_M 0xFFFF0000 // Pause Time
#define EMAC_FLOWCTL_DZQP 0x00000080 // Disable Zero-Quanta Pause
#define EMAC_FLOWCTL_UP   0x00000008 // Unicast Pause Frame Detect
#define EMAC_FLOWCTL_RFE  0x00000004 // Receive Flow Control Enable
#define EMAC_FLOWCTL_TFE  0x00000002 // Transmit Flow Control Enable
#define EMAC_FLOWCTL_FCBBPA \
    0x00000001                       // Flow Control Busy or
                                     // Back-pressure Activate
#define EMAC_FLOWCTL_PT_S 16

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_VLANTG register.
//
//*****************************************************************************
#define EMAC_VLANTG_VTHM 0x00080000 // VLAN Tag Hash Table Match Enable
#define EMAC_VLANTG_ESVL 0x00040000 // Enable S-VLAN
#define EMAC_VLANTG_VTIM 0x00020000 // VLAN Tag Inverse Match Enable
#define EMAC_VLANTG_ETV \
    0x00010000                      // Enable 12-Bit VLAN Tag
                                    // Comparison
#define EMAC_VLANTG_VL_M \
    0x0000FFFF                      // VLAN Tag Identifier for Receive
                                    // Frames
#define EMAC_VLANTG_VL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_STATUS register.
//
//*****************************************************************************
#define EMAC_STATUS_TXFF \
    0x02000000                            // TX/RX Controller TX FIFO Full
                                          // Status
#define EMAC_STATUS_TXFE \
    0x01000000                            // TX/RX Controller TX FIFO Not
                                          // Empty Status
#define EMAC_STATUS_TWC \
    0x00400000                            // TX/RX Controller TX FIFO Write
                                          // Controller Active Status
#define EMAC_STATUS_TRC_M \
    0x00300000                            // TX/RX Controller's TX FIFO Read
                                          // Controller Status
#define EMAC_STATUS_TRC_IDLE 0x00000000   // IDLE state
#define EMAC_STATUS_TRC_READ \
    0x00100000                            // READ state (transferring data to
                                          // MAC transmitter)
#define EMAC_STATUS_TRC_WAIT \
    0x00200000                            // Waiting for TX Status from MAC
                                          // transmitter
#define EMAC_STATUS_TRC_WRFLUSH \
    0x00300000                            // Writing the received TX Status
                                          // or flushing the TX FIFO
#define EMAC_STATUS_TXPAUSED 0x00080000   // MAC Transmitter PAUSE
#define EMAC_STATUS_TFC_M \
    0x00060000                            // MAC Transmit Frame Controller
                                          // Status
#define EMAC_STATUS_TFC_IDLE 0x00000000   // IDLE state
#define EMAC_STATUS_TFC_STATUS \
    0x00020000                            // Waiting for status of previous
                                          // frame or IFG or backoff period
                                          // to be over
#define EMAC_STATUS_TFC_PAUSE \
    0x00040000                            // Generating and transmitting a
                                          // PAUSE control frame (in the
                                          // full-duplex mode)
#define EMAC_STATUS_TFC_INPUT \
    0x00060000                            // Transferring input frame for
                                          // transmission
#define EMAC_STATUS_TPE \
    0x00010000                            // MAC MII Transmit Protocol Engine
                                          // Status
#define EMAC_STATUS_RXF_M \
    0x00000300                            // TX/RX Controller RX FIFO
                                          // Fill-level Status
#define EMAC_STATUS_RXF_EMPTY 0x00000000  // RX FIFO Empty
#define EMAC_STATUS_RXF_BELOW \
    0x00000100                            // RX FIFO fill level is below the
                                          // flow-control deactivate
                                          // threshold
#define EMAC_STATUS_RXF_ABOVE \
    0x00000200                            // RX FIFO fill level is above the
                                          // flow-control activate threshold
#define EMAC_STATUS_RXF_FULL 0x00000300   // RX FIFO Full
#define EMAC_STATUS_RRC_M \
    0x00000060                            // TX/RX Controller Read Controller
                                          // State
#define EMAC_STATUS_RRC_IDLE   0x00000000 // IDLE state
#define EMAC_STATUS_RRC_STATUS 0x00000020 // Reading frame data
#define EMAC_STATUS_RRC_DATA \
    0x00000040                            // Reading frame status (or
                                          // timestamp)
#define EMAC_STATUS_RRC_FLUSH \
    0x00000060                            // Flushing the frame data and
                                          // status
#define EMAC_STATUS_RWC \
    0x00000010                            // TX/RX Controller RX FIFO Write
                                          // Controller Active Status
#define EMAC_STATUS_RFCFC_M \
    0x00000006                            // MAC Receive Frame Controller
                                          // FIFO Status
#define EMAC_STATUS_RPE \
    0x00000001                            // MAC MII Receive Protocol Engine
                                          // Status
#define EMAC_STATUS_RFCFC_S 1

