fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RWUFF register.
//
//*****************************************************************************
#define EMAC_RWUFF_WAKEUPFIL_M 0xFFFFFFFF // Remote Wake-Up Frame Filter
#define EMAC_RWUFF_WAKEUPFIL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PMTCTLSTAT
// register.
//
//*****************************************************************************
#define EMAC_PMTCTLSTAT_WUPFRRST \
    0x80000000                               // Wake-Up Frame Filter Register
                                             // Pointer Reset
#define EMAC_PMTCTLSTAT_RWKPTR_M  0x07000000 // Remote Wake-Up FIFO Pointer
#define EMAC_PMTCTLSTAT_GLBLUCAST 0x00000200 // Global Unicast
#define EMAC_PMTCTLSTAT_WUPRX     0x00000040 // Wake-Up Frame Received
#define EMAC_PMTCTLSTAT_MGKPRX    0x00000020 // Magic Packet Received
#define EMAC_PMTCTLSTAT_WUPFREN   0x00000004 // Wake-Up Frame Enable
#define EMAC_PMTCTLSTAT_MGKPKTEN  0x00000002 // Magic Packet Enable
#define EMAC_PMTCTLSTAT_PWRDWN    0x00000001 // Power Down
#define EMAC_PMTCTLSTAT_RWKPTR_S  24

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_LPICTLSTAT
// register.
//
//*****************************************************************************
#define EMAC_LPICTLSTAT_LPITXA 0x00080000 // LPI TX Automate
#define EMAC_LPICTLSTAT_PLSEN  0x00040000 // PHY Link Status Enable
#define EMAC_LPICTLSTAT_PLS    0x00020000 // PHY Link Status
#define EMAC_LPICTLSTAT_LPIEN  0x00010000 // LPI Enable
#define EMAC_LPICTLSTAT_RLPIST 0x00000200 // Receive LPI State
#define EMAC_LPICTLSTAT_TLPIST 0x00000100 // Transmit LPI State
#define EMAC_LPICTLSTAT_RLPIEX 0x00000008 // Receive LPI Exit
#define EMAC_LPICTLSTAT_RLPIEN 0x00000004 // Receive LPI Entry
#define EMAC_LPICTLSTAT_TLPIEX 0x00000002 // Transmit LPI Exit
#define EMAC_LPICTLSTAT_TLPIEN 0x00000001 // Transmit LPI Entry

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_LPITIMERCTL
// register.
//
//*****************************************************************************
#define EMAC_LPITIMERCTL_LST_M 0x03FF0000 // Low Power Idle LS Timer
#define EMAC_LPITIMERCTL_LST_S 16
#define EMAC_LPITIMERCTL_TWT_M 0x0000FFFF // Low Power Idle TW Timer
#define EMAC_LPITIMERCTL_TWT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RIS register.
//
//*****************************************************************************
#define EMAC_RIS_LPI   0x00000400 // LPI Interrupt Status
#define EMAC_RIS_TS    0x00000200 // Timestamp Interrupt Status
#define EMAC_RIS_MMCTX 0x00000040 // MMC Transmit Interrupt Status
#define EMAC_RIS_MMCRX 0x00000020 // MMC Receive Interrupt Status
#define EMAC_RIS_MMC   0x00000010 // MMC Interrupt Status
#define EMAC_RIS_PMT   0x00000008 // PMT Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_IM register.
//
//*****************************************************************************
#define EMAC_IM_LPI 0x00000400 // LPI Interrupt Mask
#define EMAC_IM_TSI 0x00000200 // Timestamp Interrupt Mask
#define EMAC_IM_PMT 0x00000008 // PMT Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR0H register.
//
//*****************************************************************************
#define EMAC_ADDR0H_AE       0x80000000 // Address Enable
#define EMAC_ADDR0H_ADDRHI_M 0x0000FFFF // MAC Address0 [47:32]
#define EMAC_ADDR0H_ADDRHI_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR0L register.
//
//*****************************************************************************
#define EMAC_ADDR0L_ADDRLO_M 0xFFFFFFFF // MAC Address0 [31:0]
#define EMAC_ADDR0L_ADDRLO_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR1H register.
//
//*****************************************************************************
#define EMAC_ADDR1H_AE       0x80000000 // Address Enable
#define EMAC_ADDR1H_SA       0x40000000 // Source Address
#define EMAC_ADDR1H_MBC_M    0x3F000000 // Mask Byte Control
#define EMAC_ADDR1H_ADDRHI_M 0x0000FFFF // MAC Address1 [47:32]
#define EMAC_ADDR1H_MBC_S    24
#define EMAC_ADDR1H_ADDRHI_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR1L register.
//
//*****************************************************************************
#define EMAC_ADDR1L_ADDRLO_M 0xFFFFFFFF // MAC Address1 [31:0]
#define EMAC_ADDR1L_ADDRLO_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR2H register.
//
//*****************************************************************************
#define EMAC_ADDR2H_AE       0x80000000 // Address Enable
#define EMAC_ADDR2H_SA       0x40000000 // Source Address
#define EMAC_ADDR2H_MBC_M    0x3F000000 // Mask Byte Control
#define EMAC_ADDR2H_ADDRHI_M 0x0000FFFF // MAC Address2 [47:32]
#define EMAC_ADDR2H_MBC_S    24
#define EMAC_ADDR2H_ADDRHI_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR2L register.
//
//*****************************************************************************
#define EMAC_ADDR2L_ADDRLO_M 0xFFFFFFFF // MAC Address2 [31:0]
#define EMAC_ADDR2L_ADDRLO_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR3H register.
//
//*****************************************************************************
#define EMAC_ADDR3H_AE       0x80000000 // Address Enable
#define EMAC_ADDR3H_SA       0x40000000 // Source Address
#define EMAC_ADDR3H_MBC_M    0x3F000000 // Mask Byte Control
#define EMAC_ADDR3H_ADDRHI_M 0x0000FFFF // MAC Address3 [47:32]
#define EMAC_ADDR3H_MBC_S    24
#define EMAC_ADDR3H_ADDRHI_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_ADDR3L register.
//
//*****************************************************************************
#define EMAC_ADDR3L_ADDRLO_M 0xFFFFFFFF // MAC Address3 [31:0]
#define EMAC_ADDR3L_ADDRLO_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_WDOGTO register.
//
//*****************************************************************************
#define EMAC_WDOGTO_PWE   0x00010000 // Programmable Watchdog Enable
#define EMAC_WDOGTO_WTO_M 0x00003FFF // Watchdog Timeout
#define EMAC_WDOGTO_WTO_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MMCCTRL register.
//
//*****************************************************************************
#define EMAC_MMCCTRL_UCDBC \
    0x00000100                             // Update MMC Counters for Dropped
                                           // Broadcast Frames
#define EMAC_MMCCTRL_CNTPRSTLVL 0x00000020 // Full/Half Preset Level Value
#define EMAC_MMCCTRL_CNTPRST    0x00000010 // Counters Preset
#define EMAC_MMCCTRL_CNTFREEZ   0x00000008 // MMC Counter Freeze
#define EMAC_MMCCTRL_RSTONRD    0x00000004 // Reset on Read
#define EMAC_MMCCTRL_CNTSTPRO   0x00000002 // Counters Stop Rollover
#define EMAC_MMCCTRL_CNTRST     0x00000001 // Counters Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MMCRXRIS
// register.
//
//*****************************************************************************
#define EMAC_MMCRXRIS_UCGF \
    0x00020000 // MMC Receive Unicast Good Frame
               // Counter Interrupt Status
#define EMAC_MMCRXRIS_ALGNERR \
    0x00000040 // MMC Receive Alignment Error
               // Frame Counter Interrupt Status
#define EMAC_MMCRXRIS_CRCERR \
    0x00000020 // MMC Receive CRC Error Frame
               // Counter Interrupt Status
#define EMAC_MMCRXRIS_GBF \
    0x00000001 // MMC Receive Good Bad Frame
               // Counter Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MMCTXRIS
// register.
//
//*****************************************************************************
#define EMAC_MMCTXRIS_OCTCNT 0x00100000 // Octet Counter Interrupt Status
#define EMAC_MMCTXRIS_MCOLLGF \
    0x00008000                          // MMC Transmit Multiple Collision
                                        // Good Frame Counter Interrupt
                                        // Status
#define EMAC_MMCTXRIS_SCOLLGF \
    0x00004000                          // MMC Transmit Single Collision
                                        // Good Frame Counter Interrupt
                                        // Status
#define EMAC_MMCTXRIS_GBF \
    0x00000002                          // MMC Transmit Good Bad Frame
                                        // Counter Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MMCRXIM register.
//
//*****************************************************************************
#define EMAC_MMCRXIM_UCGF \
    0x00020000 // MMC Receive Unicast Good Frame
               // Counter Interrupt Mask
#define EMAC_MMCRXIM_ALGNERR \
    0x00000040 // MMC Receive Alignment Error
               // Frame Counter Interrupt Mask
#define EMAC_MMCRXIM_CRCERR \
    0x00000020 // MMC Receive CRC Error Frame
               // Counter Interrupt Mask
#define EMAC_MMCRXIM_GBF \
    0x00000001 // MMC Receive Good Bad Frame
               // Counter Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MMCTXIM register.
//
//*****************************************************************************
#define EMAC_MMCTXIM_OCTCNT \
    0x00100000 // MMC Transmit Good Octet Counter
               // Interrupt Mask
#define EMAC_MMCTXIM_MCOLLGF \
    0x00008000 // MMC Transmit Multiple Collision
               // Good Frame Counter Interrupt
               // Mask
#define EMAC_MMCTXIM_SCOLLGF \
    0x00004000 // MMC Transmit Single Collision
               // Good Frame Counter Interrupt
               // Mask
#define EMAC_MMCTXIM_GBF \
    0x00000002 // MMC Transmit Good Bad Frame
               // Counter Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXCNTGB register.
//
//*****************************************************************************
#define EMAC_TXCNTGB_TXFRMGB_M \
    0xFFFFFFFF // This field indicates the number
               // of good and bad frames
               // transmitted, exclusive of
               // retried frames
#define EMAC_TXCNTGB_TXFRMGB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXCNTSCOL
// register.
//
//*****************************************************************************
#define EMAC_TXCNTSCOL_TXSNGLCOLG_M \
    0xFFFFFFFF // This field indicates the number
               // of successfully transmitted
               // frames after a single collision
               // in the half-duplex mode
#define EMAC_TXCNTSCOL_TXSNGLCOLG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXCNTMCOL
// register.
//
//*****************************************************************************
#define EMAC_TXCNTMCOL_TXMULTCOLG_M \
    0xFFFFFFFF // This field indicates the number
               // of successfully transmitted
               // frames after multiple collisions
               // in the half-duplex mode
#define EMAC_TXCNTMCOL_TXMULTCOLG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXOCTCNTG
// register.
//
//*****************************************************************************
#define EMAC_TXOCTCNTG_TXOCTG_M \
    0xFFFFFFFF // This field indicates the number
               // of bytes transmitted, exclusive
               // of preamble, in good frames
#define EMAC_TXOCTCNTG_TXOCTG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXCNTGB register.
//
//*****************************************************************************
#define EMAC_RXCNTGB_RXFRMGB_M \
    0xFFFFFFFF // This field indicates the number
               // of received good and bad frames
#define EMAC_RXCNTGB_RXFRMGB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXCNTCRCERR
// register.
//
//*****************************************************************************
#define EMAC_RXCNTCRCERR_RXCRCERR_M \
    0xFFFFFFFF // This field indicates the number
               // of frames received with CRC
               // error
#define EMAC_RXCNTCRCERR_RXCRCERR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXCNTALGNERR
// register.
//
//*****************************************************************************
#define EMAC_RXCNTALGNERR_RXALGNERR_M \
    0xFFFFFFFF // This field indicates the number
               // of frames received with
               // alignment (dribble) error
#define EMAC_RXCNTALGNERR_RXALGNERR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXCNTGUNI
// register.
//
//*****************************************************************************
#define EMAC_RXCNTGUNI_RXUCASTG_M \
    0xFFFFFFFF // This field indicates the number
               // of received good unicast frames
#define EMAC_RXCNTGUNI_RXUCASTG_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_VLNINCREP
// register.
//
//*****************************************************************************
#define EMAC_VLNINCREP_CSVL 0x00080000       // C-VLAN or S-VLAN
#define EMAC_VLNINCREP_VLP  0x00040000       // VLAN Priority Control
#define EMAC_VLNINCREP_VLC_M \
    0x00030000                               // VLAN Tag Control in Transmit
                                             // Frames
#define EMAC_VLNINCREP_VLC_NONE \
    0x00000000                               // No VLAN tag deletion, insertion,
                                             // or replacement
#define EMAC_VLNINCREP_VLC_TAGDEL 0x00010000 // VLAN tag deletion
#define EMAC_VLNINCREP_VLC_TAGINS 0x00020000 // VLAN tag insertion
#define EMAC_VLNINCREP_VLC_TAGREP 0x00030000 // VLAN tag replacement
#define EMAC_VLNINCREP_VLT_M      0x0000FFFF // VLAN Tag for Transmit Frames
#define EMAC_VLNINCREP_VLT_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_VLANHASH
// register.
//
//*****************************************************************************
#define EMAC_VLANHASH_VLHT_M 0x0000FFFF // VLAN Hash Table
#define EMAC_VLANHASH_VLHT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMSTCTRL
// register.
//
//*****************************************************************************
#define EMAC_TIMSTCTRL_PTPFLTR \
    0x00040000                             // Enable MAC address for PTP Frame
                                           // Filtering
#define EMAC_TIMSTCTRL_SELPTP_M \
    0x00030000                             // Select PTP packets for Taking
                                           // Snapshots
#define EMAC_TIMSTCTRL_TSMAST \
    0x00008000                             // Enable Snapshot for Messages
                                           // Relevant to Master
#define EMAC_TIMSTCTRL_TSEVNT \
    0x00004000                             // Enable Timestamp Snapshot for
                                           // Event Messages
#define EMAC_TIMSTCTRL_PTPIPV4 \
    0x00002000                             // Enable Processing of PTP Frames
                                           // Sent over IPv4-UDP
#define EMAC_TIMSTCTRL_PTPIPV6 \
    0x00001000                             // Enable Processing of PTP Frames
                                           // Sent Over IPv6-UDP
#define EMAC_TIMSTCTRL_PTPETH \
    0x00000800                             // Enable Processing of PTP Over
                                           // Ethernet Frames
#define EMAC_TIMSTCTRL_PTPVER2 \
    0x00000400                             // Enable PTP Packet Processing For
                                           // Version 2 Format
#define EMAC_TIMSTCTRL_DGTLBIN \
    0x00000200                             // Timestamp Digital or Binary
                                           // Rollover Control
#define EMAC_TIMSTCTRL_ALLF     0x00000100 // Enable Timestamp For All Frames
#define EMAC_TIMSTCTRL_ADDREGUP 0x00000020 // Addend Register Update
#define EMAC_TIMSTCTRL_INTTRIG \
    0x00000010                             // Timestamp Interrupt Trigger
                                           // Enable
#define EMAC_TIMSTCTRL_TSUPDT   0x00000008 // Timestamp Update
#define EMAC_TIMSTCTRL_TSINIT   0x00000004 // Timestamp Initialize
#define EMAC_TIMSTCTRL_TSFCUPDT 0x00000002 // Timestamp Fine or Coarse Update
#define EMAC_TIMSTCTRL_TSEN     0x00000001 // Timestamp Enable
#define EMAC_TIMSTCTRL_SELPTP_S 16

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_SUBSECINC
// register.
//
//*****************************************************************************
#define EMAC_SUBSECINC_SSINC_M 0x000000FF // Sub-second Increment Value
#define EMAC_SUBSECINC_SSINC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMSEC register.
//
//*****************************************************************************
#define EMAC_TIMSEC_TSS_M 0xFFFFFFFF // Timestamp Second
#define EMAC_TIMSEC_TSS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMNANO register.
//
//*****************************************************************************
#define EMAC_TIMNANO_TSSS_M 0x7FFFFFFF // Timestamp Sub-Seconds
#define EMAC_TIMNANO_TSSS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMSECU register.
//
//*****************************************************************************
#define EMAC_TIMSECU_TSS_M 0xFFFFFFFF // Timestamp Second
#define EMAC_TIMSECU_TSS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMNANOU
// register.
//
//*****************************************************************************
#define EMAC_TIMNANOU_ADDSUB 0x80000000 // Add or subtract time
#define EMAC_TIMNANOU_TSSS_M 0x7FFFFFFF // Timestamp Sub-Second
#define EMAC_TIMNANOU_TSSS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMADD register.
//
//*****************************************************************************
#define EMAC_TIMADD_TSAR_M 0xFFFFFFFF // Timestamp Addend Register
#define EMAC_TIMADD_TSAR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TARGSEC register.
//
//*****************************************************************************
#define EMAC_TARGSEC_TSTR_M 0xFFFFFFFF // Target Time Seconds Register
#define EMAC_TARGSEC_TSTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TARGNANO
// register.
//
//*****************************************************************************
#define EMAC_TARGNANO_TRGTBUSY 0x80000000 // Target Time Register Busy
#define EMAC_TARGNANO_TTSLO_M  0x7FFFFFFF // Target Timestamp Low Register
#define EMAC_TARGNANO_TTSLO_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HWORDSEC
// register.
//
//*****************************************************************************
#define EMAC_HWORDSEC_TSHWR_M \
    0x0000FFFF // Target Timestamp Higher Word
               // Register
#define EMAC_HWORDSEC_TSHWR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TIMSTAT register.
//
//*****************************************************************************
#define EMAC_TIMSTAT_TSTARGT 0x00000002 // Timestamp Target Time Reached
#define EMAC_TIMSTAT_TSSOVF  0x00000001 // Timestamp Seconds Overflow

