fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PPSCTRL register.
//
//*****************************************************************************
#define EMAC_PPSCTRL_TRGMODS0_M \
    0x00000060                         // Target Time Register Mode for
                                       // PPS0 Output
#define EMAC_PPSCTRL_TRGMODS0_INTONLY \
    0x00000000                         // Indicates that the Target Time
                                       // registers are programmed only
                                       // for generating the interrupt
                                       // event
#define EMAC_PPSCTRL_TRGMODS0_INTPPS0 \
    0x00000040                         // Indicates that the Target Time
                                       // registers are programmed for
                                       // generating the interrupt event
                                       // and starting or stopping the
                                       // generation of the EN0PPS output
                                       // signal
#define EMAC_PPSCTRL_TRGMODS0_PPS0ONLY \
    0x00000060                         // Indicates that the Target Time
                                       // registers are programmed only
                                       // for starting or stopping the
                                       // generation of the EN0PPS output
                                       // signal. No interrupt is asserted
#define EMAC_PPSCTRL_PPSEN0 0x00000010 // Flexible PPS Output Mode Enable
#define EMAC_PPSCTRL_PPSCTRL_M \
    0x0000000F                         // EN0PPS Output Frequency Control
                                       // (PPSCTRL) or Command Control
                                       // (PPSCMD)

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PPS0INTVL
// register.
//
//*****************************************************************************
#define EMAC_PPS0INTVL_PPS0INT_M 0xFFFFFFFF // PPS0 Output Signal Interval
#define EMAC_PPS0INTVL_PPS0INT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PPS0WIDTH
// register.
//
//*****************************************************************************
#define EMAC_PPS0WIDTH_M 0xFFFFFFFF // EN0PPS Output Signal Width
#define EMAC_PPS0WIDTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_DMABUSMOD
// register.
//
//*****************************************************************************
#define EMAC_DMABUSMOD_RIB  0x80000000   // Rebuild Burst
#define EMAC_DMABUSMOD_TXPR 0x08000000   // Transmit Priority
#define EMAC_DMABUSMOD_MB   0x04000000   // Mixed Burst
#define EMAC_DMABUSMOD_AAL  0x02000000   // Address Aligned Beats
#define EMAC_DMABUSMOD_8XPBL \
    0x01000000                           // 8 x Programmable Burst Length
                                         // (PBL) Mode
#define EMAC_DMABUSMOD_USP \
    0x00800000                           // Use Separate Programmable Burst
                                         // Length (PBL)
#define EMAC_DMABUSMOD_RPBL_M \
    0x007E0000                           // RX DMA Programmable Burst Length
                                         // (PBL)
#define EMAC_DMABUSMOD_FB     0x00010000 // Fixed Burst
#define EMAC_DMABUSMOD_PR_M   0x0000C000 // Priority Ratio
#define EMAC_DMABUSMOD_PBL_M  0x00003F00 // Programmable Burst Length
#define EMAC_DMABUSMOD_ATDS   0x00000080 // Alternate Descriptor Size
#define EMAC_DMABUSMOD_DSL_M  0x0000007C // Descriptor Skip Length
#define EMAC_DMABUSMOD_DA     0x00000002 // DMA Arbitration Scheme
#define EMAC_DMABUSMOD_SWR    0x00000001 // DMA Software Reset
#define EMAC_DMABUSMOD_RPBL_S 17
#define EMAC_DMABUSMOD_PR_S   14
#define EMAC_DMABUSMOD_PBL_S  8
#define EMAC_DMABUSMOD_DSL_S  2

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXPOLLD register.
//
//*****************************************************************************
#define EMAC_TXPOLLD_TPD_M 0xFFFFFFFF // Transmit Poll Demand
#define EMAC_TXPOLLD_TPD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXPOLLD register.
//
//*****************************************************************************
#define EMAC_RXPOLLD_RPD_M 0xFFFFFFFF // Receive Poll Demand
#define EMAC_RXPOLLD_RPD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXDLADDR
// register.
//
//*****************************************************************************
#define EMAC_RXDLADDR_STRXLIST_M 0xFFFFFFFC // Start of Receive List
#define EMAC_RXDLADDR_STRXLIST_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_TXDLADDR
// register.
//
//*****************************************************************************
#define EMAC_TXDLADDR_TXDLADDR_M \
    0xFFFFFFFC // Start of Transmit List Base
               // Address
#define EMAC_TXDLADDR_TXDLADDR_S 2

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_DMARIS register.
//
//*****************************************************************************
#define EMAC_DMARIS_LPI 0x40000000       // LPI Trigger Interrupt Status
#define EMAC_DMARIS_TT \
    0x20000000                           // Timestamp Trigger Interrupt
                                         // Status
#define EMAC_DMARIS_PMT  0x10000000      // MAC PMT Interrupt Status
#define EMAC_DMARIS_MMC  0x08000000      // MAC MMC Interrupt
#define EMAC_DMARIS_AE_M 0x03800000      // Access Error
#define EMAC_DMARIS_AE_RXDMAWD \
    0x00000000                           // Error during RX DMA Write Data
                                         // Transfer
#define EMAC_DMARIS_AE_TXDMARD \
    0x01800000                           // Error during TX DMA Read Data
                                         // Transfer
#define EMAC_DMARIS_AE_RXDMADW \
    0x02000000                           // Error during RX DMA Descriptor
                                         // Write Access
#define EMAC_DMARIS_AE_TXDMADW \
    0x02800000                           // Error during TX DMA Descriptor
                                         // Write Access
#define EMAC_DMARIS_AE_RXDMADR \
    0x03000000                           // Error during RX DMA Descriptor
                                         // Read Access
#define EMAC_DMARIS_AE_TXDMADR \
    0x03800000                           // Error during TX DMA Descriptor
                                         // Read Access
#define EMAC_DMARIS_TS_M 0x00700000      // Transmit Process State
#define EMAC_DMARIS_TS_STOP \
    0x00000000                           // Stopped; Reset or Stop transmit
                                         // command processed
#define EMAC_DMARIS_TS_RUNTXTD \
    0x00100000                           // Running; Fetching transmit
                                         // transfer descriptor
#define EMAC_DMARIS_TS_STATUS 0x00200000 // Running; Waiting for status
#define EMAC_DMARIS_TS_RUNTX \
    0x00300000                           // Running; Reading data from host
                                         // memory buffer and queuing it to
                                         // transmit buffer (TX FIFO)
#define EMAC_DMARIS_TS_TSTAMP 0x00400000 // Writing Timestamp
#define EMAC_DMARIS_TS_SUSPEND \
    0x00600000                           // Suspended; Transmit descriptor
                                         // unavailable or transmit buffer
                                         // underflow
#define EMAC_DMARIS_TS_RUNCTD \
    0x00700000                           // Running; Closing transmit
                                         // descriptor
#define EMAC_DMARIS_RS_M 0x000E0000      // Received Process State
#define EMAC_DMARIS_RS_STOP \
    0x00000000                           // Stopped: Reset or stop receive
                                         // command issued
#define EMAC_DMARIS_RS_RUNRXTD \
    0x00020000                           // Running: Fetching receive
                                         // transfer descriptor
#define EMAC_DMARIS_RS_RUNRXD \
    0x00060000                           // Running: Waiting for receive
                                         // packet
#define EMAC_DMARIS_RS_SUSPEND \
    0x00080000                           // Suspended: Receive descriptor
                                         // unavailable
#define EMAC_DMARIS_RS_RUNCRD \
    0x000A0000                           // Running: Closing receive
                                         // descriptor
#define EMAC_DMARIS_RS_TSWS 0x000C0000   // Writing Timestamp
#define EMAC_DMARIS_RS_RUNTXD \
    0x000E0000                           // Running: Transferring the
                                         // receive packet data from receive
                                         // buffer to host memory
#define EMAC_DMARIS_NIS 0x00010000       // Normal Interrupt Summary
#define EMAC_DMARIS_AIS 0x00008000       // Abnormal Interrupt Summary
#define EMAC_DMARIS_ERI 0x00004000       // Early Receive Interrupt
#define EMAC_DMARIS_FBI 0x00002000       // Fatal Bus Error Interrupt
#define EMAC_DMARIS_ETI 0x00000400       // Early Transmit Interrupt
#define EMAC_DMARIS_RWT 0x00000200       // Receive Watchdog Timeout
#define EMAC_DMARIS_RPS 0x00000100       // Receive Process Stopped
#define EMAC_DMARIS_RU  0x00000080       // Receive Buffer Unavailable
#define EMAC_DMARIS_RI  0x00000040       // Receive Interrupt
#define EMAC_DMARIS_UNF 0x00000020       // Transmit Underflow
#define EMAC_DMARIS_OVF 0x00000010       // Receive Overflow
#define EMAC_DMARIS_TJT 0x00000008       // Transmit Jabber Timeout
#define EMAC_DMARIS_TU  0x00000004       // Transmit Buffer Unavailable
#define EMAC_DMARIS_TPS 0x00000002       // Transmit Process Stopped
#define EMAC_DMARIS_TI  0x00000001       // Transmit Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_DMAOPMODE
// register.
//
//*****************************************************************************
#define EMAC_DMAOPMODE_DT \
    0x04000000                            // Disable Dropping of TCP/IP
                                          // Checksum Error Frames
#define EMAC_DMAOPMODE_RSF 0x02000000     // Receive Store and Forward
#define EMAC_DMAOPMODE_DFF \
    0x01000000                            // Disable Flushing of Received
                                          // Frames
#define EMAC_DMAOPMODE_TSF     0x00200000 // Transmit Store and Forward
#define EMAC_DMAOPMODE_FTF     0x00100000 // Flush Transmit FIFO
#define EMAC_DMAOPMODE_TTC_M   0x0001C000 // Transmit Threshold Control
#define EMAC_DMAOPMODE_TTC_64  0x00000000 // 64 bytes
#define EMAC_DMAOPMODE_TTC_128 0x00004000 // 128 bytes
#define EMAC_DMAOPMODE_TTC_192 0x00008000 // 192 bytes
#define EMAC_DMAOPMODE_TTC_256 0x0000C000 // 256 bytes
#define EMAC_DMAOPMODE_TTC_40  0x00010000 // 40 bytes
#define EMAC_DMAOPMODE_TTC_32  0x00014000 // 32 bytes
#define EMAC_DMAOPMODE_TTC_24  0x00018000 // 24 bytes
#define EMAC_DMAOPMODE_TTC_16  0x0001C000 // 16 bytes
#define EMAC_DMAOPMODE_ST \
    0x00002000                            // Start or Stop Transmission
                                          // Command
#define EMAC_DMAOPMODE_FEF     0x00000080 // Forward Error Frames
#define EMAC_DMAOPMODE_FUF     0x00000040 // Forward Undersized Good Frames
#define EMAC_DMAOPMODE_DGF     0x00000020 // Drop Giant Frame Enable
#define EMAC_DMAOPMODE_RTC_M   0x00000018 // Receive Threshold Control
#define EMAC_DMAOPMODE_RTC_64  0x00000000 // 64 bytes
#define EMAC_DMAOPMODE_RTC_32  0x00000008 // 32 bytes
#define EMAC_DMAOPMODE_RTC_96  0x00000010 // 96 bytes
#define EMAC_DMAOPMODE_RTC_128 0x00000018 // 128 bytes
#define EMAC_DMAOPMODE_OSF     0x00000004 // Operate on Second Frame
#define EMAC_DMAOPMODE_SR      0x00000002 // Start or Stop Receive

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_DMAIM register.
//
//*****************************************************************************
#define EMAC_DMAIM_NIE 0x00010000 // Normal Interrupt Summary Enable
#define EMAC_DMAIM_AIE \
    0x00008000                    // Abnormal Interrupt Summary
                                  // Enable
#define EMAC_DMAIM_ERE 0x00004000 // Early Receive Interrupt Enable
#define EMAC_DMAIM_FBE 0x00002000 // Fatal Bus Error Enable
#define EMAC_DMAIM_ETE 0x00000400 // Early Transmit Interrupt Enable
#define EMAC_DMAIM_RWE 0x00000200 // Receive Watchdog Timeout Enable
#define EMAC_DMAIM_RSE 0x00000100 // Receive Stopped Enable
#define EMAC_DMAIM_RUE \
    0x00000080                    // Receive Buffer Unavailable
                                  // Enable
#define EMAC_DMAIM_RIE 0x00000040 // Receive Interrupt Enable
#define EMAC_DMAIM_UNE 0x00000020 // Underflow Interrupt Enable
#define EMAC_DMAIM_OVE 0x00000010 // Overflow Interrupt Enable
#define EMAC_DMAIM_TJE 0x00000008 // Transmit Jabber Timeout Enable
#define EMAC_DMAIM_TUE \
    0x00000004                    // Transmit Buffer Unvailable
                                  // Enable
#define EMAC_DMAIM_TSE 0x00000002 // Transmit Stopped Enable
#define EMAC_DMAIM_TIE 0x00000001 // Transmit Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_MFBOC register.
//
//*****************************************************************************
#define EMAC_MFBOC_OVFCNTOVF \
    0x10000000                            // Overflow Bit for FIFO Overflow
                                          // Counter
#define EMAC_MFBOC_OVFFRMCNT_M 0x0FFE0000 // Overflow Frame Counter
#define EMAC_MFBOC_MISCNTOVF \
    0x00010000                            // Overflow bit for Missed Frame
                                          // Counter
#define EMAC_MFBOC_MISFRMCNT_M 0x0000FFFF // Missed Frame Counter
#define EMAC_MFBOC_OVFFRMCNT_S 17
#define EMAC_MFBOC_MISFRMCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_RXINTWDT
// register.
//
//*****************************************************************************
#define EMAC_RXINTWDT_RIWT_M \
    0x000000FF // Receive Interrupt Watchdog Timer
               // Count
#define EMAC_RXINTWDT_RIWT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HOSTXDESC
// register.
//
//*****************************************************************************
#define EMAC_HOSTXDESC_CURTXDESC_M \
    0xFFFFFFFF // Host Transmit Descriptor Address
               // Pointer
#define EMAC_HOSTXDESC_CURTXDESC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HOSRXDESC
// register.
//
//*****************************************************************************
#define EMAC_HOSRXDESC_CURRXDESC_M \
    0xFFFFFFFF // Host Receive Descriptor Address
               // Pointer
#define EMAC_HOSRXDESC_CURRXDESC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HOSTXBA register.
//
//*****************************************************************************
#define EMAC_HOSTXBA_CURTXBUFA_M \
    0xFFFFFFFF // Host Transmit Buffer Address
               // Pointer
#define EMAC_HOSTXBA_CURTXBUFA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_HOSRXBA register.
//
//*****************************************************************************
#define EMAC_HOSRXBA_CURRXBUFA_M \
    0xFFFFFFFF // Host Receive Buffer Address
               // Pointer
#define EMAC_HOSRXBA_CURRXBUFA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PP register.
//
//*****************************************************************************
#define EMAC_PP_MACTYPE_M    0x00000700 // Ethernet MAC Type
#define EMAC_PP_MACTYPE_1    0x00000100 // Tiva TM4E129x-class MAC
#define EMAC_PP_PHYTYPE_M    0x00000007 // Ethernet PHY Type
#define EMAC_PP_PHYTYPE_NONE 0x00000000 // No PHY
#define EMAC_PP_PHYTYPE_1    0x00000003 // Snowflake class PHY

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_PC register.
//
//*****************************************************************************
#define EMAC_PC_PHYEXT   0x80000000     // PHY Select
#define EMAC_PC_PINTFS_M 0x70000000     // Ethernet Interface Select
#define EMAC_PC_PINTFS_IMII \
    0x00000000                          // MII (default) Used for internal
                                        // PHY or external PHY connected
                                        // via MII
#define EMAC_PC_PINTFS_RMII \
    0x40000000                          // RMII: Used for external PHY
                                        // connected via RMII
#define EMAC_PC_DIGRESTART 0x02000000   // PHY Soft Restart
#define EMAC_PC_NIBDETDIS \
    0x01000000                          // Odd Nibble TXER Detection
                                        // Disable
#define EMAC_PC_RXERIDLE     0x00800000 // RXER Detection During Idle
#define EMAC_PC_ISOMIILL     0x00400000 // Isolate MII in Link Loss
#define EMAC_PC_LRR          0x00200000 // Link Loss Recovery
#define EMAC_PC_TDRRUN       0x00100000 // TDR Auto Run
#define EMAC_PC_FASTLDMODE_M 0x000F8000 // Fast Link Down Mode
#define EMAC_PC_POLSWAP      0x00004000 // Polarity Swap
#define EMAC_PC_MDISWAP      0x00002000 // MDI Swap
#define EMAC_PC_RBSTMDIX     0x00001000 // Robust Auto MDI-X
#define EMAC_PC_FASTMDIX     0x00000800 // Fast Auto MDI-X
#define EMAC_PC_MDIXEN       0x00000400 // MDIX Enable
#define EMAC_PC_FASTRXDV     0x00000200 // Fast RXDV Detection
#define EMAC_PC_FASTLUPD     0x00000100 // FAST Link-Up in Parallel Detect
#define EMAC_PC_EXTFD        0x00000080 // Extended Full Duplex Ability
#define EMAC_PC_FASTANEN     0x00000040 // Fast Auto Negotiation Enable
#define EMAC_PC_FASTANSEL_M  0x00000030 // Fast Auto Negotiation Select
#define EMAC_PC_ANEN         0x00000008 // Auto Negotiation Enable
#define EMAC_PC_ANMODE_M     0x00000006 // Auto Negotiation Mode
#define EMAC_PC_ANMODE_10HD \
    0x00000000                          // When ANEN = 0x0, the mode is
                                        // 10Base-T, Half-Duplex
#define EMAC_PC_ANMODE_10FD \
    0x00000002                          // When ANEN = 0x0, the mode is
                                        // 10Base-T, Full-Duplex
#define EMAC_PC_ANMODE_100HD \
    0x00000004                          // When ANEN = 0x0, the mode is
                                        // 100Base-TX, Half-Duplex
#define EMAC_PC_ANMODE_100FD \
    0x00000006                          // When ANEN = 0x0, the mode is
                                        // 100Base-TX, Full-Duplex
#define EMAC_PC_PHYHOLD      0x00000001 // Ethernet PHY Hold
#define EMAC_PC_FASTLDMODE_S 15
#define EMAC_PC_FASTANSEL_S  4

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_CC register.
//
//*****************************************************************************
#define EMAC_CC_PTPCEN 0x00040000 // PTP Clock Reference Enable
#define EMAC_CC_POL    0x00020000 // LED Polarity Control
#define EMAC_CC_CLKEN  0x00010000 // EN0RREF_CLK Signal Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_EPHYRIS register.
//
//*****************************************************************************
#define EMAC_EPHYRIS_INT \
    0x00000001 // Ethernet PHY Raw Interrupt
               // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_EPHYIM register.
//
//*****************************************************************************
#define EMAC_EPHYIM_INT 0x00000001 // Ethernet PHY Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the EMAC_O_EPHYMISC
// register.
//
//*****************************************************************************
#define EMAC_EPHYMISC_INT \
    0x00000001 // Ethernet PHY Status and Clear
               // register

