fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the EPHY register offsets.
//
//*****************************************************************************
#define EPHY_BMCR 0x00000000    // Ethernet PHY Basic Mode Control
#define EPHY_BMSR 0x00000001    // Ethernet PHY Basic Mode Status
#define EPHY_ID1 \
    0x00000002                  // Ethernet PHY Identifier Register
                                // 1
#define EPHY_ID2 \
    0x00000003                  // Ethernet PHY Identifier Register
                                // 2
#define EPHY_ANA \
    0x00000004                  // Ethernet PHY Auto-Negotiation
                                // Advertisement
#define EPHY_ANLPA \
    0x00000005                  // Ethernet PHY Auto-Negotiation
                                // Link Partner Ability
#define EPHY_ANER \
    0x00000006                  // Ethernet PHY Auto-Negotiation
                                // Expansion
#define EPHY_ANNPTR \
    0x00000007                  // Ethernet PHY Auto-Negotiation
                                // Next Page TX
#define EPHY_ANLNPTR \
    0x00000008                  // Ethernet PHY Auto-Negotiation
                                // Link Partner Ability Next Page
#define EPHY_CFG1   0x00000009  // Ethernet PHY Configuration 1
#define EPHY_CFG2   0x0000000A  // Ethernet PHY Configuration 2
#define EPHY_CFG3   0x0000000B  // Ethernet PHY Configuration 3
#define EPHY_REGCTL 0x0000000D  // Ethernet PHY Register Control
#define EPHY_ADDAR  0x0000000E  // Ethernet PHY Address or Data
#define EPHY_STS    0x00000010  // Ethernet PHY Status
#define EPHY_SCR    0x00000011  // Ethernet PHY Specific Control
#define EPHY_MISR1 \
    0x00000012                  // Ethernet PHY MII Interrupt
                                // Status 1
#define EPHY_MISR2 \
    0x00000013                  // Ethernet PHY MII Interrupt
                                // Status 2
#define EPHY_FCSCR \
    0x00000014                  // Ethernet PHY False Carrier Sense
                                // Counter
#define EPHY_RXERCNT 0x00000015 // Ethernet PHY Receive Error Count
#define EPHY_BISTCR  0x00000016 // Ethernet PHY BIST Control
#define EPHY_LEDCR   0x00000018 // Ethernet PHY LED Control
#define EPHY_CTL     0x00000019 // Ethernet PHY Control
#define EPHY_10BTSC \
    0x0000001A                  // Ethernet PHY 10Base-T
                                // Status/Control - MR26
#define EPHY_BICSR1 \
    0x0000001B                  // Ethernet PHY BIST Control and
                                // Status 1
#define EPHY_BICSR2 \
    0x0000001C                  // Ethernet PHY BIST Control and
                                // Status 2
#define EPHY_CDCR \
    0x0000001E                  // Ethernet PHY Cable Diagnostic
                                // Control
#define EPHY_RCR    0x0000001F  // Ethernet PHY Reset Control
#define EPHY_LEDCFG 0x00000025  // Ethernet PHY LED Configuration

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BMCR register.
//
//*****************************************************************************
#define EPHY_BMCR_MIIRESET  0x00008000 // MII Register reset
#define EPHY_BMCR_MIILOOPBK 0x00004000 // MII Loopback
#define EPHY_BMCR_SPEED     0x00002000 // Speed Select
#define EPHY_BMCR_ANEN      0x00001000 // Auto-Negotiate Enable
#define EPHY_BMCR_PWRDWN    0x00000800 // Power Down
#define EPHY_BMCR_ISOLATE   0x00000400 // Port Isolate
#define EPHY_BMCR_RESTARTAN 0x00000200 // Restart Auto-Negotiation
#define EPHY_BMCR_DUPLEXM   0x00000100 // Duplex Mode
#define EPHY_BMCR_COLLTST   0x00000080 // Collision Test

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BMSR register.
//
//*****************************************************************************
#define EPHY_BMSR_100BTXFD 0x00004000 // 100Base-TX Full Duplex Capable
#define EPHY_BMSR_100BTXHD 0x00002000 // 100Base-TX Half Duplex Capable
#define EPHY_BMSR_10BTFD   0x00001000 // 10 Base-T Full Duplex Capable
#define EPHY_BMSR_10BTHD   0x00000800 // 10 Base-T Half Duplex Capable
#define EPHY_BMSR_MFPRESUP 0x00000040 // Preamble Suppression Capable
#define EPHY_BMSR_ANC      0x00000020 // Auto-Negotiation Complete
#define EPHY_BMSR_RFAULT   0x00000010 // Remote Fault
#define EPHY_BMSR_ANEN     0x00000008 // Auto Negotiation Enabled
#define EPHY_BMSR_LINKSTAT 0x00000004 // Link Status
#define EPHY_BMSR_JABBER   0x00000002 // Jabber Detect
#define EPHY_BMSR_EXTEN    0x00000001 // Extended Capability Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ID1 register.
//
//*****************************************************************************
#define EPHY_ID1_OUIMSB_M 0x0000FFFF // OUI Most Significant Bits
#define EPHY_ID1_OUIMSB_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ID2 register.
//
//*****************************************************************************
#define EPHY_ID2_OUILSB_M  0x0000FC00 // OUI Least Significant Bits
#define EPHY_ID2_VNDRMDL_M 0x000003F0 // Vendor Model Number
#define EPHY_ID2_MDLREV_M  0x0000000F // Model Revision Number
#define EPHY_ID2_OUILSB_S  10
#define EPHY_ID2_VNDRMDL_S 4
#define EPHY_ID2_MDLREV_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ANA register.
//
//*****************************************************************************
#define EPHY_ANA_NP 0x00008000       // Next Page Indication
#define EPHY_ANA_RF 0x00002000       // Remote Fault
#define EPHY_ANA_ASMDUP \
    0x00000800                       // Asymmetric PAUSE support for
                                     // Full Duplex Links
#define EPHY_ANA_PAUSE \
    0x00000400                       // PAUSE Support for Full Duplex
                                     // Links
#define EPHY_ANA_100BT4   0x00000200 // 100Base-T4 Support
#define EPHY_ANA_100BTXFD 0x00000100 // 100Base-TX Full Duplex Support
#define EPHY_ANA_100BTX   0x00000080 // 100Base-TX Support
#define EPHY_ANA_10BTFD   0x00000040 // 10Base-T Full Duplex Support
#define EPHY_ANA_10BT     0x00000020 // 10Base-T Support
#define EPHY_ANA_SELECT_M 0x0000001F // Protocol Selection
#define EPHY_ANA_SELECT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ANLPA register.
//
//*****************************************************************************
#define EPHY_ANLPA_NP       0x00008000 // Next Page Indication
#define EPHY_ANLPA_ACK      0x00004000 // Acknowledge
#define EPHY_ANLPA_RF       0x00002000 // Remote Fault
#define EPHY_ANLPA_ASMDUP   0x00000800 // Asymmetric PAUSE
#define EPHY_ANLPA_PAUSE    0x00000400 // PAUSE
#define EPHY_ANLPA_100BT4   0x00000200 // 100Base-T4 Support
#define EPHY_ANLPA_100BTXFD 0x00000100 // 100Base-TX Full Duplex Support
#define EPHY_ANLPA_100BTX   0x00000080 // 100Base-TX Support
#define EPHY_ANLPA_10BTFD   0x00000040 // 10Base-T Full Duplex Support
#define EPHY_ANLPA_10BT     0x00000020 // 10Base-T Support
#define EPHY_ANLPA_SELECT_M 0x0000001F // Protocol Selection
#define EPHY_ANLPA_SELECT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ANER register.
//
//*****************************************************************************
#define EPHY_ANER_PDF      0x00000010 // Parallel Detection Fault
#define EPHY_ANER_LPNPABLE 0x00000008 // Link Partner Next Page Able
#define EPHY_ANER_NPABLE   0x00000004 // Next Page Able
#define EPHY_ANER_PAGERX   0x00000002 // Link Code Word Page Received
#define EPHY_ANER_LPANABLE \
    0x00000001                        // Link Partner Auto-Negotiation
                                      // Able

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ANNPTR register.
//
//*****************************************************************************
#define EPHY_ANNPTR_NP     0x00008000 // Next Page Indication
#define EPHY_ANNPTR_MP     0x00002000 // Message Page
#define EPHY_ANNPTR_ACK2   0x00001000 // Acknowledge 2
#define EPHY_ANNPTR_TOGTX  0x00000800 // Toggle
#define EPHY_ANNPTR_CODE_M 0x000007FF // Code
#define EPHY_ANNPTR_CODE_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ANLNPTR register.
//
//*****************************************************************************
#define EPHY_ANLNPTR_NP     0x00008000 // Next Page Indication
#define EPHY_ANLNPTR_ACK    0x00004000 // Acknowledge
#define EPHY_ANLNPTR_MP     0x00002000 // Message Page
#define EPHY_ANLNPTR_ACK2   0x00001000 // Acknowledge 2
#define EPHY_ANLNPTR_TOG    0x00000800 // Toggle
#define EPHY_ANLNPTR_CODE_M 0x000007FF // Code
#define EPHY_ANLNPTR_CODE_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CFG1 register.
//
//*****************************************************************************
#define EPHY_CFG1_DONE     0x00008000      // Configuration Done
#define EPHY_CFG1_TDRAR    0x00000100      // TDR Auto-Run at Link Down
#define EPHY_CFG1_LLR      0x00000080      // Link Loss Recovery
#define EPHY_CFG1_FAMDIX   0x00000040      // Fast Auto MDI/MDIX
#define EPHY_CFG1_RAMDIX   0x00000020      // Robust Auto MDI/MDIX
#define EPHY_CFG1_FASTANEN 0x00000010      // Fast Auto Negotiation Enable
#define EPHY_CFG1_FANSEL_M \
    0x0000000C                             // Fast Auto-Negotiation Select
                                           // Configuration
#define EPHY_CFG1_FANSEL_BLT80  0x00000000 // Break Link Timer: 80 ms
#define EPHY_CFG1_FANSEL_BLT120 0x00000004 // Break Link Timer: 120 ms
#define EPHY_CFG1_FANSEL_BLT240 0x00000008 // Break Link Timer: 240 ms
#define EPHY_CFG1_FRXDVDET      0x00000002 // FAST RXDV Detection

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CFG2 register.
//
//*****************************************************************************
#define EPHY_CFG2_FLUPPD \
    0x00000040                          // Fast Link-Up in Parallel Detect
                                        // Mode
#define EPHY_CFG2_EXTFD     0x00000020  // Extended Full-Duplex Ability
#define EPHY_CFG2_ENLEDLINK 0x00000010  // Enhanced LED Functionality
#define EPHY_CFG2_ISOMIILL \
    0x00000008                          // Isolate MII outputs when
                                        // Enhanced Link is not Achievable
#define EPHY_CFG2_RXERRIDLE \
    0x00000004                          // Detection of Receive Symbol
                                        // Error During IDLE State
#define EPHY_CFG2_ODDNDETDIS 0x00000002 // Detection of Transmit Error

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CFG3 register.
//
//*****************************************************************************
#define EPHY_CFG3_POLSWAP  0x00000080 // Polarity Swap
#define EPHY_CFG3_MDIMDIXS 0x00000040 // MDI/MDIX Swap
#define EPHY_CFG3_FLDWNM_M 0x0000001F // Fast Link Down Modes
#define EPHY_CFG3_FLDWNM_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_REGCTL register.
//
//*****************************************************************************
#define EPHY_REGCTL_FUNC_M      0x0000C000 // Function
#define EPHY_REGCTL_FUNC_ADDR   0x00000000 // Address
#define EPHY_REGCTL_FUNC_DATANI 0x00004000 // Data, no post increment
#define EPHY_REGCTL_FUNC_DATAPIRW \
    0x00008000                             // Data, post increment on read and
                                           // write
#define EPHY_REGCTL_FUNC_DATAPIWO \
    0x0000C000                             // Data, post increment on write
                                           // only
#define EPHY_REGCTL_DEVAD_M 0x0000001F     // Device Address
#define EPHY_REGCTL_DEVAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ADDAR register.
//
//*****************************************************************************
#define EPHY_ADDAR_ADDRDATA_M 0x0000FFFF // Address or Data
#define EPHY_ADDAR_ADDRDATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_STS register.
//
//*****************************************************************************
#define EPHY_STS_MDIXM   0x00004000 // MDI-X Mode
#define EPHY_STS_RXLERR  0x00002000 // Receive Error Latch
#define EPHY_STS_POLSTAT 0x00001000 // Polarity Status
#define EPHY_STS_FCSL    0x00000800 // False Carrier Sense Latch
#define EPHY_STS_SD      0x00000400 // Signal Detect
#define EPHY_STS_DL      0x00000200 // Descrambler Lock
#define EPHY_STS_PAGERX  0x00000100 // Link Code Page Received
#define EPHY_STS_MIIREQ  0x00000080 // MII Interrupt Pending
#define EPHY_STS_RF      0x00000040 // Remote Fault
#define EPHY_STS_JD      0x00000020 // Jabber Detect
#define EPHY_STS_ANS     0x00000010 // Auto-Negotiation Status
#define EPHY_STS_MIILB   0x00000008 // MII Loopback Status
#define EPHY_STS_DUPLEX  0x00000004 // Duplex Status
#define EPHY_STS_SPEED   0x00000002 // Speed Status
#define EPHY_STS_LINK    0x00000001 // Link Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_SCR register.
//
//*****************************************************************************
#define EPHY_SCR_DISCLK   0x00008000      // Disable CLK
#define EPHY_SCR_PSEN     0x00004000      // Power Saving Modes Enable
#define EPHY_SCR_PSMODE_M 0x00003000      // Power Saving Modes
#define EPHY_SCR_PSMODE_NORMAL \
    0x00000000                            // Normal: Normal operation mode.
                                          // PHY is fully functional
#define EPHY_SCR_PSMODE_LOWPWR 0x00001000 // IEEE Power Down
#define EPHY_SCR_PSMODE_ACTWOL 0x00002000 // Active Sleep
#define EPHY_SCR_PSMODE_PASWOL 0x00003000 // Passive Sleep
#define EPHY_SCR_SBPYASS       0x00000800 // Scrambler Bypass
#define EPHY_SCR_LBFIFO_M      0x00000300 // Loopback FIFO Depth
#define EPHY_SCR_LBFIFO_4      0x00000000 // Four nibble FIFO
#define EPHY_SCR_LBFIFO_5      0x00000100 // Five nibble FIFO
#define EPHY_SCR_LBFIFO_6      0x00000200 // Six nibble FIFO
#define EPHY_SCR_LBFIFO_8      0x00000300 // Eight nibble FIFO
#define EPHY_SCR_COLFDM        0x00000010 // Collision in Full-Duplex Mode
#define EPHY_SCR_TINT          0x00000004 // Test Interrupt
#define EPHY_SCR_INTEN         0x00000002 // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_MISR1 register.
//
//*****************************************************************************
#define EPHY_MISR1_LINKSTAT 0x00002000   // Change of Link Status Interrupt
#define EPHY_MISR1_SPEED    0x00001000   // Change of Speed Status Interrupt
#define EPHY_MISR1_DUPLEXM \
    0x00000800                           // Change of Duplex Status
                                         // Interrupt
#define EPHY_MISR1_ANC \
    0x00000400                           // Auto-Negotiation Complete
                                         // Interrupt
#define EPHY_MISR1_FCHF \
    0x00000200                           // False Carrier Counter Half-Full
                                         // Interrupt
#define EPHY_MISR1_RXHF \
    0x00000100                           // Receive Error Counter Half-Full
                                         // Interrupt
#define EPHY_MISR1_LINKSTATEN 0x00000020 // Link Status Interrupt Enable
#define EPHY_MISR1_SPEEDEN    0x00000010 // Speed Change Interrupt Enable
#define EPHY_MISR1_DUPLEXMEN  0x00000008 // Duplex Status Interrupt Enable
#define EPHY_MISR1_ANCEN \
    0x00000004                           // Auto-Negotiation Complete
                                         // Interrupt Enable
#define EPHY_MISR1_FCHFEN \
    0x00000002                           // False Carrier Counter Register
                                         // half-full Interrupt Enable
#define EPHY_MISR1_RXHFEN \
    0x00000001                           // Receive Error Counter Register
                                         // Half-Full Event Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_MISR2 register.
//
//*****************************************************************************
#define EPHY_MISR2_ANERR  0x00004000   // Auto-Negotiation Error Interrupt
#define EPHY_MISR2_PAGERX 0x00002000   // Page Receive Interrupt
#define EPHY_MISR2_LBFIFO \
    0x00001000                         // Loopback FIFO Overflow/Underflow
                                       // Event Interrupt
#define EPHY_MISR2_MDICO \
    0x00000800                         // MDI/MDIX Crossover Status
                                       // Changed Interrupt
#define EPHY_MISR2_SLEEP  0x00000400   // Sleep Mode Event Interrupt
#define EPHY_MISR2_POLINT 0x00000200   // Polarity Changed Interrupt
#define EPHY_MISR2_JABBER 0x00000100   // Jabber Detect Event Interrupt
#define EPHY_MISR2_ANERREN \
    0x00000040                         // Auto-Negotiation Error Interrupt
                                       // Enable
#define EPHY_MISR2_PAGERXEN 0x00000020 // Page Receive Interrupt Enable
#define EPHY_MISR2_LBFIFOEN \
    0x00000010                         // Loopback FIFO Overflow/Underflow
                                       // Interrupt Enable
#define EPHY_MISR2_MDICOEN \
    0x00000008                         // MDI/MDIX Crossover Status
                                       // Changed Interrupt Enable
#define EPHY_MISR2_SLEEPEN \
    0x00000004                         // Sleep Mode Event Interrupt
                                       // Enable
#define EPHY_MISR2_POLINTEN \
    0x00000002                         // Polarity Changed Interrupt
                                       // Enable
#define EPHY_MISR2_JABBEREN \
    0x00000001                         // Jabber Detect Event Interrupt
                                       // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_FCSCR register.
//
//*****************************************************************************
#define EPHY_FCSCR_FCSCNT_M 0x000000FF // False Carrier Event Counter
#define EPHY_FCSCR_FCSCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_RXERCNT register.
//
//*****************************************************************************
#define EPHY_RXERCNT_RXERRCNT_M 0x0000FFFF // Receive Error Count
#define EPHY_RXERCNT_RXERRCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BISTCR register.
//
//*****************************************************************************
#define EPHY_BISTCR_PRBSM     0x00004000 // PRBS Single/Continuous Mode
#define EPHY_BISTCR_PRBSPKT   0x00002000 // Generated PRBS Packets
#define EPHY_BISTCR_PKTEN     0x00001000 // Packet Generation Enable
#define EPHY_BISTCR_PRBSCHKLK 0x00000800 // PRBS Checker Lock Indication
#define EPHY_BISTCR_PRBSCHKSYNC \
    0x00000400                           // PRBS Checker Lock Sync Loss
                                         // Indication
#define EPHY_BISTCR_PKTGENSTAT \
    0x00000200                           // Packet Generator Status
                                         // Indication
#define EPHY_BISTCR_PWRMODE 0x00000100   // Power Mode Indication
#define EPHY_BISTCR_TXMIILB \
    0x00000040                           // Transmit Data in MII Loopback
                                         // Mode
#define EPHY_BISTCR_LBMODE_M 0x0000001F  // Loopback Mode Select
#define EPHY_BISTCR_LBMODE_NPCSIN \
    0x00000001                           // Near-end loopback: PCS Input
                                         // Loopback
#define EPHY_BISTCR_LBMODE_NPCSOUT \
    0x00000002                           // Near-end loopback: PCS Output
                                         // Loopback (In 100Base-TX only)
#define EPHY_BISTCR_LBMODE_NDIG \
    0x00000004                           // Near-end loopback: Digital
                                         // Loopback
#define EPHY_BISTCR_LBMODE_NANA \
    0x00000008                           // Near-end loopback: Analog
                                         // Loopback (requires 100 Ohm
                                         // termination)
#define EPHY_BISTCR_LBMODE_FREV \
    0x00000010                           // Far-end Loopback: Reverse
                                         // Loopback

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_LEDCR register.
//
//*****************************************************************************
#define EPHY_LEDCR_BLINKRATE_M \
    0x00000600                               // LED Blinking Rate (ON/OFF
                                             // duration):
#define EPHY_LEDCR_BLINKRATE_20HZ 0x00000000 // 20 Hz (50 ms)
#define EPHY_LEDCR_BLINKRATE_10HZ 0x00000200 // 10 Hz (100 ms)
#define EPHY_LEDCR_BLINKRATE_5HZ  0x00000400 // 5 Hz (200 ms)
#define EPHY_LEDCR_BLINKRATE_2HZ  0x00000600 // 2 Hz (500 ms)

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CTL register.
//
//*****************************************************************************
#define EPHY_CTL_AUTOMDI     0x00008000 // Auto-MDIX Enable
#define EPHY_CTL_FORCEMDI    0x00004000 // Force MDIX
#define EPHY_CTL_PAUSERX     0x00002000 // Pause Receive Negotiated Status
#define EPHY_CTL_PAUSETX     0x00001000 // Pause Transmit Negotiated Status
#define EPHY_CTL_MIILNKSTAT  0x00000800 // MII Link Status
#define EPHY_CTL_BYPLEDSTRCH 0x00000080 // Bypass LED Stretching

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_10BTSC register.
//
//*****************************************************************************
#define EPHY_10BTSC_RXTHEN    0x00002000 // Lower Receiver Threshold Enable
#define EPHY_10BTSC_SQUELCH_M 0x00001E00 // Squelch Configuration
#define EPHY_10BTSC_NLPDIS \
    0x00000080                           // Normal Link Pulse (NLP)
                                         // Transmission Control
#define EPHY_10BTSC_POLSTAT   0x00000010 // 10 Mb Polarity Status
#define EPHY_10BTSC_JABBERD   0x00000001 // Jabber Disable
#define EPHY_10BTSC_SQUELCH_S 9

