fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BICSR1 register.
//
//*****************************************************************************
#define EPHY_BICSR1_ERRCNT_M    0x0000FF00 // BIST Error Count
#define EPHY_BICSR1_IPGLENGTH_M 0x000000FF // BIST IPG Length
#define EPHY_BICSR1_ERRCNT_S    8
#define EPHY_BICSR1_IPGLENGTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BICSR2 register.
//
//*****************************************************************************
#define EPHY_BICSR2_PKTLENGTH_M 0x000007FF // BIST Packet Length
#define EPHY_BICSR2_PKTLENGTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDCR register.
//
//*****************************************************************************
#define EPHY_CDCR_START         0x00008000 // Cable Diagnostic Process Start
#define EPHY_CDCR_LINKQUAL_M    0x00000300 // Link Quality Indication
#define EPHY_CDCR_LINKQUAL_GOOD 0x00000100 // Good Quality Link Indication
#define EPHY_CDCR_LINKQUAL_MILD 0x00000200 // Mid- Quality Link Indication
#define EPHY_CDCR_LINKQUAL_POOR 0x00000300 // Poor Quality Link Indication
#define EPHY_CDCR_DONE          0x00000002 // Cable Diagnostic Process Done
#define EPHY_CDCR_FAIL          0x00000001 // Cable Diagnostic Process Fail

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_RCR register.
//
//*****************************************************************************
#define EPHY_RCR_SWRST     0x00008000 // Software Reset
#define EPHY_RCR_SWRESTART 0x00004000 // Software Restart

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_LEDCFG register.
//
//*****************************************************************************
#define EPHY_LEDCFG_LED2_M        0x00000F00 // LED2 Configuration
#define EPHY_LEDCFG_LED2_LINK     0x00000000 // Link OK
#define EPHY_LEDCFG_LED2_RXTX     0x00000100 // RX/TX Activity
#define EPHY_LEDCFG_LED2_TX       0x00000200 // TX Activity
#define EPHY_LEDCFG_LED2_RX       0x00000300 // RX Activity
#define EPHY_LEDCFG_LED2_COL      0x00000400 // Collision
#define EPHY_LEDCFG_LED2_100BT    0x00000500 // 100-Base TX
#define EPHY_LEDCFG_LED2_10BT     0x00000600 // 10-Base TX
#define EPHY_LEDCFG_LED2_FD       0x00000700 // Full Duplex
#define EPHY_LEDCFG_LED2_LINKTXRX 0x00000800 // Link OK/Blink on TX/RX Activity
#define EPHY_LEDCFG_LED1_M        0x000000F0 // LED1 Configuration
#define EPHY_LEDCFG_LED1_LINK     0x00000000 // Link OK
#define EPHY_LEDCFG_LED1_RXTX     0x00000010 // RX/TX Activity
#define EPHY_LEDCFG_LED1_TX       0x00000020 // TX Activity
#define EPHY_LEDCFG_LED1_RX       0x00000030 // RX Activity
#define EPHY_LEDCFG_LED1_COL      0x00000040 // Collision
#define EPHY_LEDCFG_LED1_100BT    0x00000050 // 100-Base TX
#define EPHY_LEDCFG_LED1_10BT     0x00000060 // 10-Base TX
#define EPHY_LEDCFG_LED1_FD       0x00000070 // Full Duplex
#define EPHY_LEDCFG_LED1_LINKTXRX 0x00000080 // Link OK/Blink on TX/RX Activity
#define EPHY_LEDCFG_LED0_M        0x0000000F // LED0 Configuration
#define EPHY_LEDCFG_LED0_LINK     0x00000000 // Link OK
#define EPHY_LEDCFG_LED0_RXTX     0x00000001 // RX/TX Activity
#define EPHY_LEDCFG_LED0_TX       0x00000002 // TX Activity
#define EPHY_LEDCFG_LED0_RX       0x00000003 // RX Activity
#define EPHY_LEDCFG_LED0_COL      0x00000004 // Collision
#define EPHY_LEDCFG_LED0_100BT    0x00000005 // 100-Base TX
#define EPHY_LEDCFG_LED0_10BT     0x00000006 // 10-Base TX
#define EPHY_LEDCFG_LED0_FD       0x00000007 // Full Duplex
#define EPHY_LEDCFG_LED0_LINKTXRX 0x00000008 // Link OK/Blink on TX/RX Activity

//*****************************************************************************
//
// The following definitions are deprecated.
//
//*****************************************************************************
#ifndef DEPRECATED

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// EMAC_O_PPSCTRL register.
//
//*****************************************************************************
#define EMAC_PPSCTRL_PPSCTRL_1HZ \
    0x00000000 // When the PPSEN0 bit = 0x0, the
               // EN0PPS signal is 1 pulse of the
               // PTP reference clock.(of width
               // clk_ptp_i) every second
#define EMAC_PPSCTRL_PPSCTRL_2HZ \
    0x00000001 // When the PPSEN0 bit = 0x0, the
               // binary rollover is 2 Hz, and the
               // digital rollover is 1 Hz
#define EMAC_PPSCTRL_PPSCTRL_4HZ \
    0x00000002 // When the PPSEN0 bit = 0x0, the
               // binary rollover is 4 Hz, and the
               // digital rollover is 2 Hz
#define EMAC_PPSCTRL_PPSCTRL_8HZ \
    0x00000003 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 8 Hz, and the
               // digital rollover is 4 Hz,
#define EMAC_PPSCTRL_PPSCTRL_16HZ \
    0x00000004 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 16 Hz, and
               // the digital rollover is 8 Hz
#define EMAC_PPSCTRL_PPSCTRL_32HZ \
    0x00000005 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 32 Hz, and
               // the digital rollover is 16 Hz
#define EMAC_PPSCTRL_PPSCTRL_64HZ \
    0x00000006 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 64 Hz, and
               // the digital rollover is 32 Hz
#define EMAC_PPSCTRL_PPSCTRL_128HZ \
    0x00000007 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 128 Hz, and
               // the digital rollover is 64 Hz
#define EMAC_PPSCTRL_PPSCTRL_256HZ \
    0x00000008 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 256 Hz, and
               // the digital rollover is 128 Hz
#define EMAC_PPSCTRL_PPSCTRL_512HZ \
    0x00000009 // When thePPSEN0 bit = 0x0, the
               // binary rollover is 512 Hz, and
               // the digital rollover is 256 Hz
#define EMAC_PPSCTRL_PPSCTRL_1024HZ \
    0x0000000A // When the PPSEN0 bit = 0x0, the
               // binary rollover is 1.024 kHz,
               // and the digital rollover is 512
               // Hz
#define EMAC_PPSCTRL_PPSCTRL_2048HZ \
    0x0000000B // When thePPSEN0 bit = 0x0, the
               // binary rollover is 2.048 kHz,
               // and the digital rollover is
               // 1.024 kHz
#define EMAC_PPSCTRL_PPSCTRL_4096HZ \
    0x0000000C // When thePPSEN0 bit = 0x0, the
               // binary rollover is 4.096 kHz,
               // and the digital rollover is
               // 2.048 kHz
#define EMAC_PPSCTRL_PPSCTRL_8192HZ \
    0x0000000D // When thePPSEN0 bit = 0x0, the
               // binary rollover is 8.192 kHz,
               // and the digital rollover is
               // 4.096 kHz
#define EMAC_PPSCTRL_PPSCTRL_16384HZ \
    0x0000000E // When thePPSEN0 bit = 0x0, the
               // binary rollover is 16.384 kHz,
               // and the digital rollover is
               // 8.092 kHz
#define EMAC_PPSCTRL_PPSCTRL_32768HZ \
    0x0000000F // When thePPSEN0 bit = 0x0, the
               // binary rollover is 32.768 KHz,
               // and the digital rollover is
               // 16.384 KHz

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the EMAC_O_CC
// register.
//
//*****************************************************************************
#define EMAC_CC_CS_PA7 0x00000001 // GPIO

#endif

#endif // __HW_EMAC_H__
